<a href="https://colab.research.google.com/github/LEEGWONSEOK/CSAI_assignment/blob/main/%5B%EA%B7%B9%EB%9D%BD%5D_n212a_%EC%9D%B4%EA%B6%8C%EC%84%9D.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
## Î™®Îìà
import pandas as pd

In [ ]:
## ÏòµÏÖò
pd.options.display.float_format = '{:.3f}'.format
#pd.reset_option('display.float_format')

In [ ]:
## Îç∞Ïù¥ÌÑ∞ Î∂àÎü¨Ïò§Í∏∞
data_set = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/kc_house_data/kc_house_data.csv'
df = pd.read_csv(data_set)
df.head()

           id             date      price  ...     long  sqft_living15  sqft_lot15
0  7129300520  20141013T000000 221900.000  ... -122.257           1340        5650
1  6414100192  20141209T000000 538000.000  ... -122.319           1690        7639
2  5631500400  20150225T000000 180000.000  ... -122.233           2720        8062
3  2487200875  20141209T000000 604000.000  ... -122.393           1360        5000
4  1954400510  20150218T000000 510000.000  ... -122.045           1800        7503

[5 rows x 21 columns]

In [ ]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

### **01Î≤à Î¨∏Ï†ú**

In [ ]:
df.sort_values(by=['date'], axis=0, inplace=True)   # dataset ÏïûÎí§Î°ú 2014~2015Ïóê ÎåÄÌïú Îç∞Ïù¥ÌÑ∞Ïù∏ÏßÄ ÌôïÏù∏

test = df[df.date > '2015-01-01']               # '2015'ÎÖÑÎèÑ Îç∞Ïù¥ÌÑ∞Î•º test
train = df.drop(test.index)                     # '2014'ÎÖÑÎèÑ Îç∞Ïù¥ÌÑ∞Î•º train

print(f'train Îç∞Ïù¥ÌÑ∞ Í∞úÏàò : {train.shape}')       # 6980
print(f'test Îç∞Ïù¥ÌÑ∞ Í∞úÏàò : {test.shape}')         # 14633
# Ï†ÑÏ≤¥ Îç∞Ïù¥ÌÑ∞ Í∞úÏàò 21613

# Í≥ºÏ†úÌèº : 6980

train Îç∞Ïù¥ÌÑ∞ Í∞úÏàò : (14633, 21)
test Îç∞Ïù¥ÌÑ∞ Í∞úÏàò : (6980, 21)

### **02Î≤à Î¨∏Ï†ú**

In [ ]:
## Î™®Îìà
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from matplotlib import style

from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error

In [ ]:
## scikit-learn ÏÇ¨Ïö©Ìï¥ÏÑú Îã§Ï§ëÏÑ†ÌòïÌöåÍ∑Ä Î™®Îç∏ ÎßåÎì§Í∏∞
model = LinearRegression()

features = ['bathrooms', 'sqft_living']
X_train = train[features]
X_test = test[features]

target = 'price'
y_train = train[target]
y_test = test[target]

## train_data ÎèåÎ†§Î≥¥Í∏∞
model.fit(X_train, y_train)

y_pred_train = model.predict(X_train)
y_pred_test = model.predict(X_test)


mae = mean_absolute_error(y_train, y_pred_train)
print(f'train error : {mae:.2f}')

train error : 170777.34

In [ ]:
## test_data ÎèåÎ†§Î≥¥Í∏∞
y_pred = model.predict(X_test)
mae = mean_absolute_error(y_test, y_pred_test)
print(f'test error : {mae}')

# Í≥ºÏ†úÌèº : 179252.52593261775

test error : 179252.52593261775

### **03Î≤à Î¨∏Ï†ú**

In [ ]:
model.intercept_, model.coef_

print(f'coefficients : {model.coef_[1]}')      # ['bathrooms','sqft_living']
print(f'intercept : {model.intercept_}')

# Í≥ºÏ†úÌèº : 286.1375355497683

coefficients : 286.1375355497683
intercept : -50243.56279640319

### **04Î≤à Î¨∏Ï†ú**

In [ ]:
## Î™®Îìà
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import r2_score

In [ ]:
## train Îç∞Ïù¥ÌÑ∞ ÌôïÏù∏
mean_absolute_error(y_train, y_pred_train)
mse = mean_squared_error(y_train, y_pred_train)
mae = mean_absolute_error(y_train, y_pred_train)
rmse = mse ** 0.5
r2 = r2_score(y_train, y_pred_train)

display(pd.DataFrame([['MSE',mse],['MAE',mae],['RMSE',rmse],['R2',r2]], columns = [['category', 'result(train)']]))

# ‚Üí

  category   result(train)
0      MSE 67099053309.954
1      MAE      170777.342
2     RMSE      259034.850
3       R2           0.508

In [ ]:
## test Îç∞Ïù¥ÌÑ∞ ÌôïÏù∏
mean_absolute_error(y_test, y_pred_test)
mse = mean_squared_error(y_test, y_pred_test)
mae = mean_absolute_error(y_test, y_pred_test)
rmse = mse ** 0.5
r2 = r2_score(y_test, y_pred_test)

display(pd.DataFrame([['MSE',mse],['MAE',mae],['RMSE',rmse],['R2',r2]], columns = [['category', 'result(test)']]))


# Í≥ºÏ†úÌèº : 0.46

  category    result(test)
0      MSE 71083994178.757
1      MAE      179252.526
2     RMSE      266615.818
3       R2           0.460

### **üî•ÎèÑÏ†ÑÍ≥ºÏ†ú**